Repository: Amao-J/Afrimart
Catalog: src/locale/*/LC_MESSAGES/django.po
Languages: sw

source: English
sw: Kiingereza

source: French
sw: Kifaransa

source: Swahili
sw: Kiswahili

source: Arabic
sw: Kiarabu

source: Free Shipping
sw: Usafirishaji Bila Malipo

source: This Weekend For New Users
sw: Wiki hii kwa watumiaji wapya

source: Home
sw: Nyumbani

source: Categories
sw: Vikundi

source: Electronics
sw: Vifaa vya umeme

source: Fashion
sw: Mavazi

source: Jewelry
sw: Mapambo

source: Cosmetics
sw: Vipodozi

source: Men's
sw: Wanaume

source: Shirts
sw: Mashati

source: Shorts & Jeans
sw: Suruali fupi na Jeans

source: Safety Shoes
sw: Viatu vya usalama

source: Wallets
sw: Mifuko ya fedha

source: Women's
sw: Wanawake

source: Dresses
sw: Mavazi

source: Earrings
sw: Herini

source: Necklaces
sw: Minyororo

source: Makeup Kits
sw: Seti za Vipodozi

source: Rings
sw: Pete

source: Bracelets
sw: Bangili

source: Perfume
sw: Manukato

source: Clothes Perfume
sw: Manukato ya nguo

source: Deodorant
sw: Deyodoranti

source: Fragrances
sw: Harufu

source: Air Freshener
sw: Manukato ya hewa

source: Blog
sw: Blogu

source: Hot Offers
sw: Matoleo Moto

source: Menu
sw: Menyu

source: Products
sw: Bidhaa

source: My Orders
sw: Maagizo Yangu

source: Dashboard
sw: Dashibodi

source: Profile
sw: Wasifu

source: Wallet
sw: Mfuko

source: Logout
sw: Toka

source: Login
sw: Ingia

source: Register
sw: Jisajili

source: Popular Categories
sw: Vikundi Maarufu

source: Health & Beauty
sw: Afya na Urembo

source: Watches
sw: Saa

source: Accessories
sw: Vifaa

source: Quick Links
sw: Viungo Vya Haraka

source: New Arrivals
sw: Vitu Vipya

source: Best Sellers
sw: Zilizouzwa Zaidi

source: Price Drops
sw: Kupungua kwa Bei

source: Contact Us
sw: Wasiliana Nasi

source: Sitemap
sw: Ramani ya Tovuti

source: Customer Care
sw: Huduma kwa Wateja

source: About Us
sw: Kuhusu Sisi

source: Delivery Information
sw: Taarifa za Uwasilishaji

source: Terms & Conditions
sw: Masharti na Vigezo

source: Privacy Policy
sw: Sera ya Faragha

source: Returns & Refunds
sw: Kurudisha na Marejesho

source: Secure Payment
sw: Malipo Salama

source: Starting at
sw: Kuanzia

source: Shop Now
sw: Nunua Sasa

source: Modern Sunglasses
sw: Miwani ya Kisasa

source: New Fashion Summer Sale
sw: Mauzo Mapya ya Majira

source: Shop By Category
sw: Nunua Kwa Kikundi

source: Bags
sw: Mikoba

source: Winter Wear
sw: Mavazi ya Baridi

source: Glasses & Lens
sw: Miwani na Lens

source: Tan Tops
sw: Vitu vya Tan

source: Trousers
sw: Suruali

source: Belts
sw: Mikanda

source: Show All
sw: Onyesha Yote

source: Trending
sw: Maarufu

source: Deal of the Day
sw: Ofa ya Leo
